/*===============================================================================
 * Name        : adc.h
 * Author      : $(author)
 * Version     :
 * CPU type    : ARM Cortex-M3 LPC1343
 * Copyright   : $(copyright)
 * Description : A/D conversion definitions
 *===============================================================================*/
#ifndef	_ADC_H_
#define	_ADC_H_

/*----------------------------------------------------------------------
 * A/D変換のチャネル
 *----------------------------------------------------------------------*/
#define	ADC_CH0		(0)		// AN1, 左センサ
#define	ADC_CH1		(1)		// AN2, 右センサ
#define	ADC_LEFT	ADC_CH0	// AN1, 左センサ
#define	ADC_RIGHT	ADC_CH1	// AN2, 左センサ

/*----------------------------------------------------------------------
 * 関数のプロトタイプ宣言
 *----------------------------------------------------------------------*/
extern void ADC_INIT(void);
extern unsigned short ADC_READ(unsigned char ch);
extern void ADC_READ2(unsigned short *L, unsigned short *R);

#ifdef	EXAMPLE
/*===============================================================================
 * A/D変換の動作確認
 *
 * - バーストモードをサポート（ADC_MODE = ADC_MODE_BURST）
 * - 赤外センサの出力特性
 *	・反射光低（黒地の反射率低） --> センサ出力 = 高
 *	・反射光高（白地の反射率高） --> センサ出力 = 低
 *
 * - 座標系の考え方（白地に黒ラインの場合）
 *  ・進行方向をy軸の正、右方向をx軸の正、原点を黒ラインにとる
 *  ・車が原点より左側（右センサが黒線に近い） --> 左センサ出力 - 右センサ出力 < 0
 *  ・車が原点より右側（左センサが黒線に近い） --> 左センサ出力 - 右センサ出力 > 0
 *
 *     Y
 *     ^
 *     |
 * ----+--->X
 *===============================================================================*/
extern void ADC_EXAMPLE(void);
#endif // EXAMPLE

#endif // _ADC_H_
