/*===============================================================================
 * Name        : timer.h
 * Author      : $(author)
 * Version     :
 * CPU type    : ARM Cortex-M3 LPC1343
 * Copyright   : $(copyright)
 * Description : Hardware / Software timer definitions
 *===============================================================================*/
#ifndef _TIMER_H_
#define _TIMER_H_

/*----------------------------------------------------------------------
 * タイマーカウンタの更新方法
 * 1 = 割り込みにより変数をカウントアップする
 * 0 = 割り込みを使用せず、直接 Timer Counter Register をアクセスする
 *----------------------------------------------------------------------*/
#define	COUNT_BY_INTTERUPT	0

/*----------------------------------------------------------------------
 * 1[msec]を刻むプリスケールの設定
 * 16.8.4 PreScale Register (TMR32B1PR)
 *----------------------------------------------------------------------*/
#define	TIMER_PRE_SCALE		72000	// 1[KHz] = 0.001[sec]

/*----------------------------------------------------------------------
 * 関数のプロトタイプ宣言、関数へのNULLポインタ
 *----------------------------------------------------------------------*/
extern void TIMER_INIT(void);
extern unsigned long TIMER_READ(void);
extern void TIMER_WAKEUP(unsigned long msec, void (*f)(void));

/*----------------------------------------------------------------------
 * 指定時間[msec]の待機、待機のキャンセル
 * TIMER_INIT()が実行された場合は Hardware timer を使用する
 *----------------------------------------------------------------------*/
extern void WAIT(unsigned long msec);
extern void WAIT_CANCEL(void);

/*----------------------------------------------------------------------
 * 長時間（約49日）の待機
 * 使用例：
 *	SW_WATCH(WAIT_CANCEL);
 *	WAIT(WAIT_FOREVER);
 *----------------------------------------------------------------------*/
#define	WAIT_FOREVER	(unsigned long)(-1)

#endif /* _TIMER_H_ */
