/*===============================================================================
 Name        : trace.h
 Author      : $(author)
 Version     :
 Model type  : VS-WRC103LV
 Copyright   : $(copyright)
 Description : Pulse Width Demodulator definitions using CT16B0, CT16B1
===============================================================================*/
#ifndef _TRACE_H_
#define _TRACE_H_

/*----------------------------------------------------------------------
 * 関数のプロトタイプ宣言
 *----------------------------------------------------------------------*/
extern void TRACE_RUN(int method);

/*----------------------------------------------------------------------
 * 赤外線(Infrared)センサのキャリブレーションパラメータ
 *----------------------------------------------------------------------*/
typedef struct {
	short offset;		// センサの原点位置調整用オフセット
	short center;		// 中央とみなせる左右間偏差の閾値
	short gainIR[2];	// センサ出力を正規化する左右の補正係数[%]
} CalibrateIR_t;

/*----------------------------------------------------------------------
 * 赤外線(Infrared)センサの観測データ
 *----------------------------------------------------------------------*/
#define N_SAMPLES	64		// 観測データのサンプル数
#define MTR_POWER	0x2000	// モーター制御量（トレースラインを十分に跨ぐ程度の出力）

typedef struct {
	short L;
	short R;
} IRData_t;

#endif // _TRACE_H_
