/*===============================================================================
 * Name        : main.c
 * Author      : $(author)
 * Version     :
 * Model type  : VS-WRC103LV
 * Copyright   : $(copyright)
 * Description : main function
 *===============================================================================*/
#include "ioport.h"
#include "timer.h"
#include "adc.h"
#include "pwm.h"
#include "play.h"
#include "sci.h"
#include "pmu.h"
#include "wdt.h"
#include "trace.h"

/*----------------------------------------------------------------------
 * メイン関数
 *----------------------------------------------------------------------*/
int main(void) {
#if		0
	/*-----------------------------------------
	 * 汎用I/Oポートの動作確認
	 *-----------------------------------------*/
	PORT_EXAMPLE();

#elif	0
	/*-----------------------------------------
	 * A/D変換の動作確認
	 *-----------------------------------------*/
	ADC_EXAMPLE();

#elif	0
	/*-----------------------------------------
	 * モーターPWM制御の動作確認
	 *  1: 直進性を確認し、駆動系のゲインを調整する
	 *  2: 前進 --> 右旋回 --> 左旋回 --> 後退
	 *-----------------------------------------*/
	PWM_EXAMPLE(1);

#elif	0
	/*-----------------------------------------
	 * USBシリアル通信の動作確認
	 *	1: エコーバック
	 *	2: printf(), scanf()
	 *-----------------------------------------*/
	SCI_EXAMPLE(2);

#elif	0
	/*-----------------------------------------
	 * ウォッチドッグタイマーの動作確認
	 *	1: メイン処理中でウォッチドッグを叩く
	 *	2: SysTick割り込み中でウォッチドッグを叩く
	 *-----------------------------------------*/
	WDT_EXAMPLE(1);

#elif	0
	/*-----------------------------------------
	 * パワーマネジメントユニットの動作確認
	 *	1: Active mode　でのスリープ
	 *	2: Sleep/Deep-sleep/Deep Power-down
	 *-----------------------------------------*/
	PMU_EXAMPLE(2);

#elif	0
	/*-----------------------------------------
	 * バックグランド演奏の動作確認
	 *-----------------------------------------*/
	PLAY_EXAMPLE();

#else
	/*-----------------------------------------
	 * ライントレース
	 *  0: 赤外線センサの特性計測
	 *  1: ON-OFF制御によるライントレース
	 *  2: ON-OFF制御＋P制御によるライントレース
	 *  3: PD制御によるライントレース
	 *-----------------------------------------*/
	TRACE_RUN(3);

#endif

	return 0;
}
